{
Напишите программу для решения следующей задачи. Девятиклассники участвовали в викторине по математике.
Необходимо было ответить на 20 вопросов. Победителем викторины считается участник, правильно ответивший на наибольшее количество вопросов. На сколько вопросов победитель ответил правильно?
Если есть участники викторины, которые не смогли дать правильный ответ ни на один из вопросов, выведите YES, иначе выведите NO. Гарантируется, что есть участники, правильно ответившие хотя бы на один из вопросов.
Программа получает на вход число участников викторины N (1 ≤ N ≤ 50), затем для каждого участника вводится количество вопросов, на которые получен правильный ответ.
}

var
  max, number, amount: integer;
  flag: boolean;
  
begin
  flag := false;
  max := -1;
  readln(amount);
  for var i := 1 to amount do
  begin
    read(number);
    if number = 0 then flag := true;
    if number > max then max := number;
  end;
  writeln(max);
  if flag then writeln('YES') else writeln('NO'); 
end.