{
20.2 Напишите программу, которая в последовательности натуральных чисел определяет максимальное число, кратное 5. 
Программа получает на вход количество чисел в последовательности, а затем сами числа. 
В последовательности всегда имеется число, кратное 5. Количество чисел не превышает 1000. 
Введённые числа не превышают 30 000. Программа должна вывести одно число — максимальное число, кратное 5.
}
var
  amount, number, max: integer;
begin
  read(amount);
  max := 0;
  for var i := 1 to amount do
  begin
    read(number);
    if (number > max) and (number mod 5 = 0) then max := number;
  end;
  writeln(max);
end.