{Напишите программу для решения следующей задачи. 
Камера наблюдения регистрирует в автоматическом режиме скорость проезжающих мимо неё автомобилей, округляя значения скорости до целых чисел. Необходимо определить: 
1)	разность максимальной и минимальной скоростей автомобилей;
2)	количество автомобилей, скорость которых не превышала 30 км/ч. 
Программа получает на вход число проехавших автомобилей N (1 ≤ N ≤ 30), затем указываются их скорости.
 Значение скорости не может быть меньше 1 и больше 300. Программа должна сначала вывести разность максимальной и минимальной скоростей автомобилей, затем количество автомобилей, скорость которых не превышала 30 км/ч.
}
var
N,a,i,max,min,s:integer;
begin
max:=0;
min:=301;
s:=0;
readln(N);
for i:=1 to N do
begin
readln(a);
if a>max then max:=a;
if a<min then min:=a;
if a<=30 then s+=1;
end;
writeln(max-min);writeln(s);
end.


