{
Напишите программу, которая по двум данным натуральным числам a и b, не превосходящим 30000, подсчитывает количество чётных натуральных чисел на отрезке [a, b] (включая концы отрезка). 
Программа получает на вход два натуральных числа a и b, при этом гарантируется, что 1 ≤ a ≤ b ≤ 30000. Проверять входные данные на корректность не нужно. 
Программа должна вывести одно число: количество чётных чисел на отрезке [a, b].
}

var
  a, b, amount: integer;
  
begin
  amount := 0;
  readln(a, b);
  for var number := a to b do
  begin
    if number mod 2 = 0 then amount += 1;
  end;
  writeln(amount);
end.