{
Напишите программу, которая в последовательности целых чисел определяет их сумму и подсчитывает разность количества положительных и отрицательных чисел последовательности. 
Программа получает на вход целые числа, количество введённых чисел неизвестно, последовательность чисел заканчивается числом 0 (0 — признак окончания ввода, не входит в последовательность).

Количество чисел не превышает 1000. Введённые числа по модулю не превышают 30 000. Программа должна вывести два числа: сумму чисел и разность количества положительных и отрицательных чисел.
}

var
  number, amountPol, amountOtr, sum: integer;
  
begin
  amountPol := 0;
  amountOtr := 0;
  sum := 0;
  read(number);
  while number <> 0 do
  begin
    if number > 0 then amountPol += 1;
    if number < 0 then amountOtr += 1;
    sum += number;
    read(number);
  end;
  writeln(sum);
  writeln(amountPol - amountOtr);
end.