{Напишите программу, которая в последовательности натуральных чисел определяет минимальное число, кратное 3.
 Программа получает на вход количество чисел в последовательности, а затем сами числа. 
 В последовательности всегда имеется число, кратное 3. Количество чисел не превышает 1000. Введённые числа не превышают 30 000. Программа должна вывести одно число — минимальное число, кратное 3.
}

var
 amount, number, min: integer;
begin
  read(amount);
  min := 30001;
  for var i := 1 to amount do
  begin
    read(number);
    if (number < min) and (number mod 3 = 0) then min := number;
  end;
  writeln(min);
end.
 