{Введите с клавиатуры 5 положительных целых чисел. 
Вычислите сумму тех из них, которые делятся на 4 и при этом заканчиваются на 6.
 Программа должна вывести одно число: сумму чисел, введенных с клавиатуры, кратных 4 и оканчивающихся на 6.
}
var
a,i,sum:integer;
begin
  sum := 0;
  for i:= 1 to 5 do begin
    readln(a);
    if (a mod 4 = 0) and (a mod 10 = 6) then sum:=sum+a;
    end;
    writeln(sum);
end.